financial.org
#+TITLE: Financial Resources
* Advice & Research
  - [[https://Bogleheads.org][Bogleheads Wiki]]
  - [[https://Investopedia.com][Investopedia]]
  - [[https://DaveRamsey.com][Dave Ramsey]]
  - [[https://moneyguy.com][The Money Guy Show]]
* Youtube channels
  - [[https://youtube.com/user/FinancingLife101][FinancingLife]]
  - [[https://youtube.com/user/MoneyGuyShow][The Money Guy Show]]
  - [[https://youtube.com/channel/UCL8w_A8p8P1HWI3k6PR5Z6w][Two Cents]]
  - [[https://youtube.com/channel/UCV6KDgJskWaEckne5aPA0aQ][Graham Stephan]]
  - [[https://youtube.com/channel/UCzpwkXk_GlfmWntZ9v4l3Tg][The Dave Ramsey Show LIVE]]
  - [[https://youtube.com/user/ChrisHogan360][Chris Hogan]]
  - [[https://youtube.com/user/DaveRamseyShow][The Dave Ramsey Show]]
  - [[https://youtube.com/channel/UCFCEuCsyWP0YkP3CZ3Mr01Q][The Plain Bagel]]
  - [[https://youtube.com/channel/UCGy7SkBjcIAgTiwkXEtPnYg][Andrei Jikh]]
  - [[https://youtube.com/channel/UCbta0n8i6Rljh0obO7HzG9A][Joseph Carlson]]
  - [[https://youtube.com/user/kenclarkchannel][Kenny Robinson]]
  - [[https://youtube.com/channel/UCBIt1VN5j37PVM8LLSuTTlw][Improvement Pill]]
  - [[https://youtube.com/user/whygoldandsilver][GoldSilver with Mike Maloney]]
* Youtube Playlists
  - [[https://youtube.com/watch?v%3DatZJ4lU3IBE&list%3DPL21534875BFC50EEE][Rules About Investing For Beginners]]
  - [[https://youtube.com/watch?v%3DZFRReCL_lLw&list%3DPLdpkIg5_Ms4At-DZbPbkxujh2EGOnOu6H][Why Bother With Bonds]]
  - [[https://youtube.com/watch?v%3DKliNYvTasgg&list%3DPLJ1Tti2OGXsCHUCtlfnT2wUFShFdj1iHc][Robert Kiyosaki explains his philosophy: Income, Expenses, Assets, & Liabilities, Employee, Business, & Investor taxation]]
* Videos
  - [[https://youtube.com/watch?v%3DMD71ryp39x0][Robert Kiyosaki: Protect and Cover Your ASSets with Corporations and Entities]]
  - [[https://youtube.com/watch?v%3DXdSp5GXbiE4][Protecting assets from legal settlements with LLCs: Proper Use of LLCs for Real Estate]]
  - [[https://youtube.com/watch?v%3Dul32Yf9KJB0&list%3DPL3FUah8ohZLyEGjh5I38MHL0Sl1fuzs13&index%3D15][Why You Should Use a Land Trust for Real Estate]]
  - [[https://youtube.com/watch?v%3DNNS8aWhNpS4&list%3DPL3FUah8ohZLyEGjh5I38MHL0Sl1fuzs13&index%3D14][What a land trust protects against: Purchasing Property With a Land Trust]]
* Books
  These books are frequently available as audiobooks on YouTube
  - Rich Dad Poor Dad by Robert Kiyosaki, ISBN13 978-1612680170
  - The Richest Man in Babylon by George S. Clason, ISBN13 978-1508524359
  - The Total Money Makeover by Dave Ramsey, ISBN13 978-1595555274
  - Everyday Millionaires by Chris Hogan, ISBN13 978-0977489527
* Financial Institutions
** Investment
   - [[https://Vanguard.com][Vanguard]]
   - [[https://Fidelity.com][Fidelity]]
   - [[https://Wealthfront.com][Wealthfront]]
** Insurance
   - [[https://Zanderins.com][Zander Insurance]]
   - [[https://usaa.com][USAA]]
** Loans
   - [[https://NavyFederal.org][Navy Federal]]
* Financial Charting
  - [[https://finance.yahoo.com][Yahoo Finance]]
  - [[https://tradingview.com][TradingView]]
  - [[https://bitcoincharts.com][Bitcoincharts]]
  - [[https://cryptowat.ch][Cryptowatch]]
