financial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Financial Resources</title>
<!-- 2019-10-23 Wed 13:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Evan James McCarter" />
</head>
<body>
<div id="content">
<h1 class="title">Financial Resources</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Advice &amp; Research</a></li>
<li><a href="#sec-2">2. Youtube channels</a></li>
<li><a href="#sec-3">3. Youtube Playlists</a></li>
<li><a href="#sec-4">4. Videos</a></li>
<li><a href="#sec-5">5. Books</a></li>
<li><a href="#sec-6">6. Financial Institutions</a>
<ul>
<li><a href="#sec-6-1">6.1. Investment</a></li>
<li><a href="#sec-6-2">6.2. Insurance</a></li>
<li><a href="#sec-6-3">6.3. Loans</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Financial Charting</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Advice &amp; Research</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://Bogleheads.org">Bogleheads Wiki</a>
</li>
<li><a href="https://Investopedia.com">Investopedia</a>
</li>
<li><a href="https://DaveRamsey.com">Dave Ramsey</a>
</li>
<li><a href="https://moneyguy.com">The Money Guy Show</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Youtube channels</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://youtube.com/user/FinancingLife101">FinancingLife</a>
</li>
<li><a href="https://youtube.com/user/MoneyGuyShow">The Money Guy Show</a>
</li>
<li><a href="https://youtube.com/channel/UCL8w_A8p8P1HWI3k6PR5Z6w">Two Cents</a>
</li>
<li><a href="https://youtube.com/channel/UCV6KDgJskWaEckne5aPA0aQ">Graham Stephan</a>
</li>
<li><a href="https://youtube.com/channel/UCzpwkXk_GlfmWntZ9v4l3Tg">The Dave Ramsey Show LIVE</a>
</li>
<li><a href="https://youtube.com/user/ChrisHogan360">Chris Hogan</a>
</li>
<li><a href="https://youtube.com/user/DaveRamseyShow">The Dave Ramsey Show</a>
</li>
<li><a href="https://youtube.com/channel/UCFCEuCsyWP0YkP3CZ3Mr01Q">The Plain Bagel</a>
</li>
<li><a href="https://youtube.com/channel/UCGy7SkBjcIAgTiwkXEtPnYg">Andrei Jikh</a>
</li>
<li><a href="https://youtube.com/channel/UCbta0n8i6Rljh0obO7HzG9A">Joseph Carlson</a>
</li>
<li><a href="https://youtube.com/user/kenclarkchannel">Kenny Robinson</a>
</li>
<li><a href="https://youtube.com/channel/UCBIt1VN5j37PVM8LLSuTTlw">Improvement Pill</a>
</li>
<li><a href="https://youtube.com/user/whygoldandsilver">GoldSilver with Mike Maloney</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Youtube Playlists</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://youtube.com/watch?v=atZJ4lU3IBE&list=PL21534875BFC50EEE">Rules About Investing For Beginners</a>
</li>
<li><a href="https://youtube.com/watch?v=ZFRReCL_lLw&list=PLdpkIg5_Ms4At-DZbPbkxujh2EGOnOu6H">Why Bother With Bonds</a>
</li>
<li><a href="https://youtube.com/watch?v=KliNYvTasgg&list=PLJ1Tti2OGXsCHUCtlfnT2wUFShFdj1iHc">Robert Kiyosaki explains his philosophy: Income, Expenses, Assets, &amp; Liabilities, Employee, Business, &amp; Investor taxation</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Videos</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://youtube.com/watch?v=MD71ryp39x0">Robert Kiyosaki: Protect and Cover Your ASSets with Corporations and Entities</a>
</li>
<li><a href="https://youtube.com/watch?v=XdSp5GXbiE4">Protecting assets from legal settlements with LLCs: Proper Use of LLCs for Real Estate</a>
</li>
<li><a href="https://youtube.com/watch?v=ul32Yf9KJB0&list=PL3FUah8ohZLyEGjh5I38MHL0Sl1fuzs13&index=15">Why You Should Use a Land Trust for Real Estate</a>
</li>
<li><a href="https://youtube.com/watch?v=NNS8aWhNpS4&list=PL3FUah8ohZLyEGjh5I38MHL0Sl1fuzs13&index=14">What a land trust protects against: Purchasing Property With a Land Trust</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Books</h2>
<div class="outline-text-2" id="text-5">
<p>
These books are frequently available as audiobooks on YouTube
</p>
<ul class="org-ul">
<li>Rich Dad Poor Dad by Robert Kiyosaki, ISBN13 978-1612680170
</li>
<li>The Richest Man in Babylon by George S. Clason, ISBN13 978-1508524359
</li>
<li>The Total Money Makeover by Dave Ramsey, ISBN13 978-1595555274
</li>
<li>Everyday Millionaires by Chris Hogan, ISBN13 978-0977489527
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Financial Institutions</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Investment</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li><a href="https://Vanguard.com">Vanguard</a>
</li>
<li><a href="https://Fidelity.com">Fidelity</a>
</li>
<li><a href="https://Wealthfront.com">Wealthfront</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Insurance</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li><a href="https://Zanderins.com">Zander Insurance</a>
</li>
<li><a href="https://usaa.com">USAA</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Loans</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li><a href="https://NavyFederal.org">Navy Federal</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Financial Charting</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://finance.yahoo.com">Yahoo Finance</a>
</li>
<li><a href="https://tradingview.com">TradingView</a>
</li>
<li><a href="https://bitcoincharts.com">Bitcoincharts</a>
</li>
<li><a href="https://cryptowat.ch">Cryptowatch</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Evan James McCarter</p>
<p class="date">Created: 2019-10-23 Wed 13:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
